Masmiseim36/nxpSDK/boards/hvpkv31f120m/demo_apps/mc_acim/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT4_FTM0FLT0_FTM 0x00u /*!<@brief FTM0 Fault 0 Select: FTM0_FLT0 pin */

/*! @name PORTC1 (number 71), MB_J11[A14]/MB_U12[18]/MB_PWM_AT/J4[A14]/PWM0
  @{ */

/* Symbols to be used with PORT driver */
#define MB_PWM_AT_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define MB_PWM_AT_PIN 1U                   /*!<@brief PORT pin number */
#define MB_PWM_AT_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTC2 (number 72), MB_J11[A15]/MB_U12[12]/MB_PWM_AB/J4[A15]/PWM1
  @{ */

/* Symbols to be used with PORT driver */
#define MB_PWM_AB_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define MB_PWM_AB_PIN 2U                   /*!<@brief PORT pin number */
#define MB_PWM_AB_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTC4 (number 76), MB_J11[A17]/MB_U12[13]/MB_PWM_BB/J4[A17]/PWM3
  @{ */

/* Symbols to be used with PORT driver */
#define MB_PWM_BB_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define MB_PWM_BB_PIN 4U                   /*!<@brief PORT pin number */
#define MB_PWM_BB_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTC5 (number 77), MB_J11[A16]/MB_U12[19]/MB_PWM_BT/J4[A16]/PWM2
  @{ */

/* Symbols to be used with PORT driver */
#define MB_PWM_BT_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define MB_PWM_BT_PIN 5U                   /*!<@brief PORT pin number */
#define MB_PWM_BT_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTD4 (number 97), MB_J11[A18]/MB_U12[20]/MB_PWM_CT/J4[A18]/PWM4
  @{ */

/* Symbols to be used with PORT driver */
#define MB_PWM_CT_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define MB_PWM_CT_PIN 4U                   /*!<@brief PORT pin number */
#define MB_PWM_CT_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTD5 (number 98), MB_J11[A19]/MB_U12[14]/MB_PWM_CB/J4[A19]/PWM5
  @{ */

/* Symbols to be used with PORT driver */
#define MB_PWM_CB_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define MB_PWM_CB_PIN 5U                   /*!<@brief PORT pin number */
#define MB_PWM_CB_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTA19 (number 51), MB_J11[A25]/MB_U12[11]/MB_TP28/MB_FAULT/MB_FAULT_1/MB_PFC_overcurrent/J4[A25]/FAULT_1
  @{ */

/* Symbols to be used with PORT driver */
#define MB_FAULT_1_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define MB_FAULT_1_PIN 19U                   /*!<@brief PORT pin number */
#define MB_FAULT_1_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitMC_PWMPins(void);

/*! @name PORTC0 (number 70), MB_J11[B25]/MB_U9[2]/MB_TP_35/MB_MCU_BRAKE/J4[B25]/MCU_BRAKE
  @{ */

/* Symbols to be used with GPIO driver */
#define MB_MCU_BRAKE_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define MB_MCU_BRAKE_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MB_MCU_BRAKE_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define MB_MCU_BRAKE_PIN 0U                   /*!<@brief PORT pin number */
#define MB_MCU_BRAKE_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC13 (number 85), MB_J11[B28]/MB_Q3[1]/MB_Relay/J4[B28]/Relay
  @{ */

/* Symbols to be used with GPIO driver */
#define MB_RELAY_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define MB_RELAY_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MB_RELAY_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define MB_RELAY_PIN 13U                   /*!<@brief PORT pin number */
#define MB_RELAY_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTB19 (number 65), MB_J11[B20]/MB_U9[4]/MB_USER_LED/J4[B20]/USER_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define MB_LED_GREEN_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define MB_LED_GREEN_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define MB_LED_GREEN_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define MB_LED_GREEN_PIN 19U                   /*!<@brief PORT pin number */
#define MB_LED_GREEN_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MB_InitMISCPins(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTB16 (number 62), U2[24]/U6[13]/TxD_sda/UART_TX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UART_TX_TGTMCU_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_UART_TX_TGTMCU_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_UART_TX_TGTMCU_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTB17 (number 63), U2[25]/U6[14]/RxD_sda/UART_RX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UART_RX_TGTMCU_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_UART_RX_TGTMCU_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_UART_RX_TGTMCU_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
